Import pandas

In [1]:
import pandas as pd

Read the `titanic3.xls` file and set 'name' as the index

In [2]:
titanic = pd.read_excel("titanic3.xls", index_col="name")
titanic.head()

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
name,,,,,,,,,,,,,
"Allen, Miss. Elisabeth Walton",1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
"Allison, Master. Hudson Trevor",1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Miss. Helen Loraine",1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
"Allison, Mr. Hudson Joshua Creighton",1,0,male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,0,female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Drop the following columns: `['home.dest', 'embarked', 'sibsp', 'parch']`

In [3]:
titanic.drop(columns=["home.dest", "embarked", "sibsp", "parch"], inplace=True)

Filter out all the passengers which did not survive.

In [4]:
titanic = titanic[titanic["survived"] == 1]

Considering that the **body** column is only used for passengers who did not survive, drop that column, and then do the same thing for the **survived** column.

In [5]:
titanic.drop(columns=["body", "survived"], inplace=True)

What is the max **fare** in **3rd class**?

In [6]:
titanic.loc[titanic["pclass"] == 3, "fare"].max()

np.float64(56.4958)

Rename the index name of 'name' to 'Passenger'

In [7]:
titanic.index.name = "Passenger"

**BONUS**

Create a new column that's called "Free Coffee", insert 1 if a passenger is either in 1st or 2nd class, otherwise insert 0

In [8]:
titanic["Free Coffee"] = 0

titanic.loc[titanic["pclass"].isin([1, 2]), "Free Coffee"] = 1

Use value_counts() to verify that 3rd class doesn't get any free coffee

In [9]:
titanic[["pclass", "Free Coffee"]].value_counts()

pclass  Free Coffee
1       1              200
3       0              181
2       1              119
Name: count, dtype: int64